package com.whiteflame.homework.demo05;

public class Test {
    public static void main(String[] args) {
/*        某林业工人孙工，作息规律为上三天班，休息一天，经常不确定休息日是否是周末。
        为此，请你开发一个程序，当孙工输入年以及月，以日历方式显示对应月份的休息日，
        用中括号进行标记（可以查看以前的休息情况和将来的休息情况）。同时，统计出本月有几天休息，
        轮到周末休息有几天。（注：首次休息日是2020年2月1日）*/



    }
    public static void day(String str){

        //1.将输入的年份和月份传入LocalDate类，找到该月份的最大天数

        //2.计算输入月份月末-首次休息日的间隔天数

        //3.计算间隔天数中的休息日并放入集合中

        //4.在间隔天的休息日中找到该查询月份的休息日并放入集合中

        //5.计算该月休息日的天数
    }
}
